## Handling Missing Values
-`mean` for numeriacal data we can replace missing values with mean or median of the feature
-`mode` for categorial data we use mode remember for categorical data only mode is used to fill null values `mean` and `median` are only compatible with numerical data

In [2]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns

# Importing dataset

df = pd.read_csv('../../Datasets/titanic.csv')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Replacing Values with `median`

In [3]:
# Checking Null values
df.isnull().sum()
# checking unique values
df['age'].value_counts()

# Handling missing values with mean
med = df['age'].median()
#old method
# df['age'].fillna(med , inplace=True)
# new method of pandas 3.0
df['age'] = df['age'].fillna(med)
df['age'].isnull().sum()

0

### Replacing Values with `mean`

In [4]:
dfs = pd.read_csv('../../Datasets/titanic.csv')
# Shows total null values in dataset
dfs.isnull().sum()
# Shows unique values in particular feature
dfs['age'].value_counts()
# count null values in feature
dfs['age'].isnull().sum()
# Check mean and median of feature
dfs['age'].mean()
# Checking median of numerical feature
dfs['age'].median()
# Replacing Null values in feature
dfs['age'] = dfs['age'].fillna(dfs['age'].mean())
# Checking total null values
dfs['age'].isnull().sum()

0

### Replacing Values with `mode`
Replacing Values using Mode (`Only for categorical values`)  
`Thing to remember` There will be more than one mode in a feature so we will get the very first which comes.  
`mode()` method in pandas will return an array of modes we will get the first by passing the index `0`

In [5]:
# Checking null values 
dfs['deck'].isnull().sum()
# Checking Mode
dfs['deck'].mode()
# Getting the first mode
dfs['deck'].mode()[0]
# Fill the missing Values with mode
dfs['deck'] = dfs['deck'].fillna(dfs['deck'].mode()[0])
# Checking null values 
dfs['deck'].isnull().sum()
dfs['deck'].value_counts()

deck
C    747
B     47
D     33
E     32
A     15
F     13
G      4
Name: count, dtype: int64

### HANDLE MISSING VALUES USING SCIKIT LEARN (`mean` , `median` , `mode`)

In [20]:
# Replacing NULL values with mean using SimpleImputer
import pandas as pd
from sklearn.impute import SimpleImputer

sdf = pd.read_csv('../../Datasets/titanic.csv')
sdf.head()
imp = SimpleImputer(strategy='mean')
sdf['age'] = imp.fit_transform(sdf[['age']])
sdf.isnull().sum()
sdf['deck'].head()

0    NaN
1      C
2    NaN
3      C
4    NaN
Name: deck, dtype: object

In [ ]:
# Replacing NULL values with median using SimpleImputer
from sklearn.impute import SimpleImputer
med = sns.load_dataset('titanic')
imput = SimpleImputer(strategy='median')
med['age'] = imput.fit_transform(med[['age']])
med['age'].isnull().sum()

0

#### Replacing NULL / Missing values in categorical variables

In [19]:
med['deck'].head()
imp = SimpleImputer(strategy='most_frequent')
med['deck'] = imp.fit_transform(med[['deck']]).ravel()
med['deck'].head()

0    C
1    C
2    C
3    C
4    C
Name: deck, dtype: object